# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\dgilliland\Documents\GitHub\RPI_PSOC5\RPS_PSOC5_01\RPS_PSOC5_01.cydsn\RPS_PSOC5_01.cyprj
# Date: Mon, 07 Oct 2019 16:35:44 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_6} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_5} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {Clock_7} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {Clock_8} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_7}]]
create_clock -name {CyScBoostClk} -period 93.75 -waveform {0 46.875} [list [get_pins {ClockBlock/aclk_glb_0}]]


# Component constraints for C:\Users\dgilliland\Documents\GitHub\RPI_PSOC5\RPS_PSOC5_01\RPS_PSOC5_01.cydsn\TopDesign\PSoC5\TopDesign.cysch
# Project: C:\Users\dgilliland\Documents\GitHub\RPI_PSOC5\RPS_PSOC5_01\RPS_PSOC5_01.cydsn\RPS_PSOC5_01.cyprj
# Date: Mon, 07 Oct 2019 16:35:39 GMT
